project04/app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 0)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "title", "author", "updated_at", "update_count", "fulltext") VALUES('2011-02-20 20:49:22', 'safd', 'asdfasd', '2011-02-20 20:49:22', 0, 'asdf;alshdg;a!!!')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 15)
UPDATE "articles" SET "updated_at" = '2011-02-21 09:27:06', "update_count" = 1 WHERE "id" = 15

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1